#include "stm32f10x.h"



/***************************************************************************************************
 * TOF 参数 宏定义
 ***************************************************************************************************/
//硬件IIC读取设置， IIC设定ID只取高七位地址 即 设定ID:0X04  实际传感器ID:0X02
#define TOF_R  0X04//右传感器地址      实际传感器ID：HEX:0X02   DEC:2    设定ID:0X04
#define TOF_MR 0x18 //中右传感器地址   实际传感器ID：HEX:0X0C   DEC:12   设定ID:0X18

#define TOF_ML 0x2C //中左传感器地址   实际传感器ID：HEX:0X16   DEC:22   设定ID:0X2C  
#define TOF_L  0x40 //左传感器地址     实际传感器ID：HEX:0X20   DEC:32   设定ID:0X40 

#define DATA_mode  0x08      //数据模式地址 
#define SEND_mode  0x09      //发送方式地址
#define DISTANCE_data  0x00  //0x00-0x01为实时距离


/***************************************************************************************************
 * TOF 结构体
 ***************************************************************************************************/
typedef struct{
	int RIGHT_MM;
	int MIDDLE_R_MM;
	int MIDDLE_L_MM;
	int LEFT_MM;  	
}TOF_Distance;


/***************************************************************************************************
 * TOF 读取函数
 ***************************************************************************************************/
void TOF250_READ(TOF_Distance *TOF_D);//读取分别读取三个传感器的值		 				   